cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.svd
		<register>
			<name>INTSET</name>
			<description>Interrupt set register.</description>
			<addressOffset>0xFEC</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTSET</name>
					<description>Writing a 1 to one sets the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>POWERDOWN</name>
			<description>Power-down register.</description>
			<addressOffset>0xFF4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[30:0]</bitRange>
				</field>
				<field>
					<name>PD</name>
					<description>PowerDownMACAHB. If true, all AHB accesses will return a read/write error, except accesses to the Power-Down register.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
		</peripheral>
		<peripheral>
	<name>LCD</name>
	<description>LCD controller  </description>
	<groupName>LCD</groupName>
	<baseAddress>0x20088000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>LCD</name>
	<value>37</value>
	</interrupt>
	<registers>
		<register>
			<name>TIMH</name>
			<description>Horizontal Timing Control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>PPL</name>
					<description>Pixels-per-line. The PPL bit field specifies the number of pixels in each line or row of the screen. PPL is a 6-bit value that represents between 16 and 1024 pixels per line. PPL counts the number of pixel clocks that occur before the HFP is applied. Program the value required divided by 16, minus 1. Actual pixels-per-line = 16 * (PPL + 1). For example, to obtain 320 pixels per line, program PPL as (320/16) -1 = 19.</description>
					<bitRange>[7:2]</bitRange>
				</field>
				<field>
					<name>HSW</name>
					<description>Horizontal synchronization pulse width. The 8-bit HSW field specifies the pulse width of the line clock in passive mode, or the horizontal synchronization pulse in active mode. Program with desired value minus 1.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>HFP</name>
					<description>Horizontal front porch. The 8-bit HFP field sets the number of pixel clock intervals at the end of each line or row of pixels, before the LCD line clock is pulsed. When a complete line of pixels is transmitted to the LCD driver, the value in HFP counts the number of pixel clocks to wait before asserting the line clock. HFP can generate a period of 1-256 pixel clock cycles. Program with desired value minus 1.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>HBP</name>
					<description>Horizontal back porch. The 8-bit HBP field is used to specify the number of pixel clock periods inserted at the beginning of each line or row of pixels. After the line clock for the previous line has been deasserted, the value in HBP counts the number of pixel clocks to wait before starting the next display line. HBP can generate a delay of 1-256 pixel clock cycles. Program with desired value minus 1.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TIMV</name>
			<description>Vertical Timing Control register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LPP</name>
					<description>Lines per panel. This is the number of active lines per screen. The LPP field specifies the total number of lines or rows on the LCD panel being controlled. LPP is a 10-bit value allowing between 1 and 1024 lines. Program the register with the number of lines per LCD panel, minus 1. For dual panel displays, program the register with the number of lines on each of the upper and lower panels.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>VSW</name>
					<description>Vertical synchronization pulse width. This is the number of horizontal synchronization lines. The 6-bit VSW field specifies the pulse width of the vertical synchronization pulse. Program the register with the number of lines required, minus one. The number of horizontal synchronization lines must be small (for example, program to zero) for passive STN LCDs. The higher the value the worse the contrast on STN LCDs.</description>
					<bitRange>[15:10]</bitRange>
				</field>
				<field>
					<name>VFP</name>
					<description>Vertical front porch. This is the number of inactive lines at the end of a frame, before the vertical synchronization period. The 8-bit VFP field specifies the number of line clocks to insert at the end of each frame. When a complete frame of pixels is transmitted to the LCD display, the value in VFP is used to count the number of line clock periods to wait. After the count has elapsed, the vertical synchronization signal, LCD_FP, is asserted in active mode, or extra line clocks are inserted as specified by the VSW bit-field in passive mode. VFP generates 0-255 line clock cycles. Program to zero on passive displays for improved contrast.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>VBP</name>
					<description>Vertical back porch. This is the number of inactive lines at the start of a frame, after the vertical synchronization period. The 8-bit VBP field specifies the number of line clocks inserted at the beginning of each frame. The VBP count starts immediately after the vertical synchronization signal for the previous frame has been negated for active mode, or the extra line clocks have been inserted as specified by the VSW bit field in passive mode. After this has occurred, the count value in VBP sets the number of line clock periods inserted before the next frame. VBP generates 0 to 255 extra line clock cycles. Program to zero on passive displays for improved contrast.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>POL</name>
			<description>Clock and Signal Polarity Control register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PCD_LO</name>
					<description>Lower five bits of panel clock divisor. The ten-bit PCD field, comprising PCD_HI (bits 31:27 of this register) and PCD_LO, is used to derive the LCD panel clock frequency LCD_DCLK from the input clock, LCD_DCLK = LCDCLK/(PCD+2). For monochrome STN displays with a 4 or 8-bit interface, the panel clock is a factor of four and eight down from the actual individual pixel clock rate. For color STN displays, 22/3 pixels are output per LCD_DCLK cycle, so the panel clock is 0.375 times the pixel rate. For TFT displays, the pixel clock divider can be bypassed by setting the BCD bit in this register. Note: data path latency forces some restrictions on the usable minimum values for the panel clock divider in STN modes: Single panel color mode, PCD = 1 (LCD_DCLK = LCDCLK/3). Dual panel color mode, PCD = 4 (LCD_DCLK = LCDCLK/6). Single panel monochrome 4-bit interface mode, PCD = 2(LCD_DCLK = LCDCLK/4). Dual panel monochrome 4-bit interface mode and single panel monochrome 8-bit interface mode, PCD = 6(LCD_DCLK = LCDCLK/8). Dual panel monochrome 8-bit interface mode, PCD = 14(LCD_DCLK = LCDCLK/16).</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>CLKSEL</name>
					<description>Clock Select. This bit controls the selection of the source for LCDCLK. 0 = the clock source for the LCD block is CCLK. 1 = the clock source for the LCD block is LCD_CLKIN (external clock input for the LVD).</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ACB</name>
					<description>AC bias pin frequency. The AC bias pin frequency is only applicable to STN displays. These require the pixel voltage polarity to periodically reverse to prevent damage caused by DC charge accumulation. Program this field with the required value minus one to apply the number of line clocks between each toggle of the AC bias pin, LCD_ENAB_M. This field has no effect if the LCD is operating in TFT mode, when the LCD_ENAB_M pin is used as a data enable signal.</description>
					<bitRange>[10:6]</bitRange>
				</field>
				<field>
					<name>IVS</name>
					<description>Invert vertical synchronization. The IVS bit inverts the polarity of the LCD_FP signal. 0 = LCD_FP pin is active HIGH and inactive LOW. 1 = LCD_FP pin is active LOW and inactive HIGH.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>IHS</name>
					<description>Invert horizontal synchronization. The IHS bit inverts the polarity of the LCD_LP signal. 0 = LCD_LP pin is active HIGH and inactive LOW. 1 = LCD_LP pin is active LOW and inactive HIGH.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>IPC</name>
					<description>Invert panel clock. The IPC bit selects the edge of the panel clock on which pixel data is driven out onto the LCD data lines. 0 = Data is driven on the LCD data lines on the rising edge of LCD_DCLK. 1 = Data is driven on the LCD data lines on the falling edge of LCD_DCLK.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>IOE</name>
					<description>Invert output enable. This bit selects the active polarity of the output enable signal in TFT mode. In this mode, the LCD_ENAB_M pin is used as an enable that indicates to the LCD panel when valid display data is available. In active display mode, data is driven onto the LCD data lines at the programmed edge of LCD_DCLK when LCD_ENAB_M is in its active state. 0 = LCD_ENAB_M output pin is active HIGH in TFT mode. 1 = LCD_ENAB_M output pin is active LOW in TFT mode.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>CPL</name>
					<description>Clocks per line. This field specifies the number of actual LCD_DCLK clocks to the LCD panel on each line. This is the number of PPL divided by either 1 (for TFT), 4 or 8 (for monochrome passive), 2 2/3 (for color passive), minus one. This must be correctly programmed in addition to the PPL bit in the LCD_TIMH register for the LCD display to work correctly.</description>
					<bitRange>[25:16]</bitRange>
				</field>
				<field>
					<name>BCD</name>
					<description>Bypass pixel clock divider. Setting this to 1 bypasses the pixel clock divider logic. This is mainly used for TFT displays.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>PCD_HI</name>
					<description>Upper five bits of panel clock divisor. See description for PCD_LO, in bits [4:0] of this register.</description>
					<bitRange>[31:27]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>LE</name>
			<description>Line End Control register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LED</name>
					<description>Line-end delay. Controls Line-end signal delay from the rising-edge of the last panel clock, LCD_DCLK. Program with the number of LCDCLK clock periods minus 1.</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:7]</bitRange>
				</field>
				<field>
					<name>LEE</name>
					<description>LCD Line end enable. 0 = LCD_LE disabled (held LOW). 1 = LCD_LE signal active.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>UPBASE</name>
			<description>Upper Panel Frame Base Address register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>LCDUPBASE</name>
					<description>LCD upper panel base address. This is the start address of the upper panel frame data in memory and is doubleword aligned.</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>LPBASE</name>
			<description>Lower Panel Frame Base Address register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>LCDLPBASE</name>
					<description>LCD lower panel base address. This is the start address of the lower panel frame data in memory and is doubleword aligned.</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL</name>
			<description>LCD Control register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LCDEN</name>
					<description>LCD enable control bit. 0 = LCD disabled. Signals LCD_LP, LCD_DCLK, LCD_FP, LCD_ENAB_M, and LCD_LE are low. 1 = LCD enabled. Signals LCD_LP, LCD_DCLK, LCD_FP, LCD_ENAB_M, and LCD_LE are high. See LCD power-up and power-down sequence for details on LCD power sequencing.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>LCDBPP</name>
					<description>LCD bits per pixel. Selects the number of bits per LCD pixel: 000 = 1 bpp. 001 = 2 bpp. 010 = 4 bpp. 011 = 8 bpp. 100 = 16 bpp. 101 = 24 bpp (TFT panel only). 110 = 16 bpp, 5:6:5 mode. 111 = 12 bpp, 4:4:4 mode.</description>
					<bitRange>[3:1]</bitRange>
				</field>
				<field>
					<name>LCDBW</name>
					<description>STN LCD monochrome/color selection. 0 = STN LCD is color. 1 = STN LCD is monochrome. This bit has no meaning in TFT mode.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>LCDTFT</name>
					<description>LCD panel TFT type selection. 0 = LCD is an STN display. Use gray scaler. 1 = LCD is a TFT display. Do not use gray scaler.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>LCDMONO8</name>
					<description>Monochrome LCD interface width. Controls whether a monochrome STN LCD uses a 4 or 8-bit parallel interface. It has no meaning in other modes and must be programmed to zero. 0 = monochrome LCD uses a 4-bit interface. 1 = monochrome LCD uses a 8-bit interface.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>LCDDUAL</name>
					<description>Single or Dual LCD panel selection. STN LCD interface is: 0 = single-panel. 1 = dual-panel.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>BGR</name>
					<description>Color format selection. 0 = RGB: normal output. 1 = BGR: red and blue swapped.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>BEBO</name>
					<description>Big-endian Byte Order. Controls byte ordering in memory: 0 = little-endian byte order. 1 = big-endian byte order.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>BEPO</name>
					<description>Big-Endian Pixel Ordering. Controls pixel ordering within a byte: 0 = little-endian ordering within a byte. 1 = big-endian pixel ordering within a byte. The BEPO bit selects between little and big-endian pixel packing for 1, 2, and 4 bpp display modes, it has no effect on 8 or 16 bpp pixel formats. See Pixel serializer for more information on the data format.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>LCDPWR</name>
					<description>LCD power enable. 0 = power not gated through to LCD panel and LCD_VD[23:0] signals disabled, (held LOW). 1 = power gated through to LCD panel and LCD_VD[23:0] signals enabled, (active).  See LCD power-up and power-down sequence for details on LCD power sequencing.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>LCDVCOMP</name>
					<description>LCD Vertical Compare Interrupt. Generate VComp interrupt at: 00 = start of vertical synchronization. 01 = start of back porch. 10 = start of active video. 11 = start of front porch.</description>
					<bitRange>[13:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:14]</bitRange>
				</field>
				<field>
					<name>WATERMARK</name>
					<description>LCD DMA FIFO watermark level. Controls when DMA requests are generated: 0 = An LCD DMA request is generated when either of the DMA FIFOs have four or more empty locations. 1 = An LCD DMA request is generated when either of the DMA FIFOs have eight or more empty locations.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTMSK</name>
			<description>Interrupt Mask register</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>FUFIM</name>
					<description>FIFO underflow interrupt enable. 0: The FIFO underflow interrupt is disabled. 1: Interrupt will be generated when the FIFO underflows.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>LNBUIM</name>
					<description>LCD next base address update interrupt enable. 0: The base address update interrupt is disabled. 1: Interrupt will be generated when the LCD base address registers have been updated from the next address registers.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>VCOMPIM</name>
					<description>Vertical compare interrupt enable. 0: The vertical compare time interrupt is disabled. 1: Interrupt will be generated when the vertical compare time (as defined by LcdVComp field in the LCD_CTRL register) is reached.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>BERIM</name>
					<description>AHB master error interrupt enable. 0: The AHB Master error interrupt is disabled. 1: Interrupt will be generated when an AHB Master error occurs.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
