cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.svd
				</field>
				<field>
					<name>EPERRINTCLR6</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR7</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR8</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR9</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR10</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR11</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR12</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR13</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR14</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR15</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR16</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[16:16]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR17</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[17:17]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR18</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[18:18]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR19</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[19:19]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR20</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[20:20]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR21</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[21:21]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR22</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[22:22]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR23</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[23:23]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR24</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[24:24]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR25</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[25:25]</bitRange>
										
