cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.svd
				</field>
				<field>
					<name>CTSIE</name>
					<description>CTS Interrupt Enable. If auto-cts mode is enabled this bit enables/disables the modem status interrupt generation on a CTS1 signal transition. If auto-cts mode is disabled a CTS1 transition will generate an interrupt if Modem Status Interrupt Enable (IER[3]) is set. In normal operation a CTS1 signal transition will generate a Modem Status Interrupt unless the interrupt has been disabled by clearing the IER[3] bit in the IER register. In auto-cts mode a transition on the CTS1 bit will trigger an interrupt only if both the IER[3] and IER[7] bits are set.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_THE_CTS_INTE</name>
							<description>Disable the CTS interrupt.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_THE_CTS_INTER</name>
							<description>Enable the CTS interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ABEOIE</name>
					<description>Enables the end of auto-baud interrupt.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_END_OF_AUTO_</name>
							<description>Disable end of auto-baud Interrupt.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_END_OF_AUTO_B</name>
							<description>Enable end of auto-baud Interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ABTOIE</name>
					<description>Enables the auto-baud time-out interrupt.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_AUTO_BAUD_TI</name>
							<description>Disable auto-baud time-out Interrupt.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_AUTO_BAUD_TIM</name>
							<description>Enable auto-baud time-out Interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:10]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>IIR</name>
			<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-only</access>
			<resetValue>0x01</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTSTATUS</name>
					<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>AT_LEAST_ONE_INTERRU</name>
							<description>At least one interrupt is pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_INTERRUPT_IS_PEND</name>
							<description>No interrupt is pending.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTID</name>
					<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART1 Rx or TX FIFO. All other combinations of IER[3:1] not listed below are reserved (100,101,111).</description>
					<bitRange>[3:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RLS</name>
							<description>1   - Receive Line Status (RLS).</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RDA</name>
							<description>2a - Receive Data Available (RDA).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CTI</name>
							<description>2b - Character Time-out Indicator (CTI).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRE</name>
							<description>3   - THRE Interrupt.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MODEM</name>
							<description>4   - Modem Interrupt.</description>
							<value>0x0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[5:4]</bitRange>

				</field>
				<field>
					<name>FIFOENABLE</name>
					<description>Copies of FCR[0].</description>
					<bitRange>[7:6]</bitRange>

				</field>
				<field>
					<name>ABEOINT</name>
					<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
					<bitRange>[8:8]</bitRange>

				</field>
				<field>
					<name>ABTOINT</name>
					<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
					<bitRange>[9:9]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, the value read from a reserved bit is not defined.</description>
					<bitRange>[31:10]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>FCR</name>
			<description>FIFO Control Register. Controls UART1 FIFO usage and modes.</description>
			<alternateRegister>IIR</alternateRegister>
			<addressOffset>0x008</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FIFOEN</name>
					<description>FIFO enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MUST_NOT_BE_USED_IN_</name>
							<description>Must not be used in the application.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE_HIGH_ENABLE_F</name>
							<description>Active high enable for both UART1 Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART1 operation. Any transition on this bit will automatically clear the UART1 FIFOs.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXFIFORES</name>
					<description>RX FIFO Reset.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_IMPACT_ON_EITHER_</name>
							<description>No impact on either of UART1 FIFOs.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITING_A_LOGIC_1_TO</name>
							<description>Writing a logic 1 to FCR[1] will clear all bytes in UART1 Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXFIFORES</name>
					<description>TX FIFO Reset.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_IMPACT_ON_EITHER_</name>
							<description>No impact on either of UART1 FIFOs.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITING_A_LOGIC_1_TO</name>
							<description>Writing a logic 1 to FCR[2] will clear all bytes in UART1 TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMODE</name>
					<description>DMA Mode Select. When the FIFO enable bit (bit 0 of this register) is set, this bit selects the DMA mode. See Section 36.6.6.1.</description>
					<bitRange>[3:3]</bitRange>

