cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CCLKSEL</name>
			<description>CPU Clock Selection register</description>
			<addressOffset>0x104</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CCLKDIV</name>
					<description>Selects the divide value for creating the CPU clock (CCLK) from the selected clock source. 0 = The divider is turned off., no clock will be provided to the CPU. This setting should typically not be used, the CPU will be halted and a reset will be required to restore operation. 1 = The input clock is divided by 1 to produce the CPU clock. 2 = The input clock is divided by 2 to produce the CPU clock. 3 = The input clock is divided by 3 to produce the CPU clock. ... 31 = The input clock is divided by 31 to produce the CPU clock.</description>
					<bitRange>[4:0]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:5]</bitRange>

				</field>
				<field>
					<name>CCLKSEL</name>
					<description>Selects the input clock for the CPU clock divider.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SYSCLK_IS_USED_AS_TH</name>
							<description>Sysclk is used as the input to the CPU clock divider.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_OUTPUT_OF_THE_MA</name>
							<description>The output of the Main PLL is used as the input to the CPU clock divider.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:9]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKSEL</name>
			<description>USB Clock Selection register</description>
			<addressOffset>0x108</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>USBDIV</name>
					<description>Selects the divide value for creating the USB clock from the selected PLL output. Only the values shown below can produce even number multiples of 48 MHz from the PLL. Warning: Improper setting of this value will result in incorrect operation of the USB interface. Only the main oscillator in conjunction with either PLL0 or PLL1 can provide a clock that meets USB accuracy and jitter specifications. Other values cannot produce the 48 MHz clock required for USB operation.</description>
					<bitRange>[4:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_DIVIDER_IS_TURNE</name>
							<description>The divider is turned off, no clock will be provided to the USB subsystem.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL0_OUTPUT_IS_DIVID</name>
							<description>PLL0 output is divided by 4. PLL0 output must be 192 MHz.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL0_OUTPUT_IS_DIVID</name>
							<description>PLL0 output is divided by 6. PLL0 output must be 288 MHz.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:5]</bitRange>

				</field>
				<field>
					<name>USBSEL</name>
					<description>Selects the input clock for the USB clock divider.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SYSCLK_IS_USED_AS_TH</name>
							<description>Sysclk is used as the input to the USB clock divider. When this clock is selected, the USB can be accessed by software but cannot perform USB functions.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_OUTPUT_OF_THE_MA</name>
							<description>The output of the Main PLL is used as the input to the USB clock divider.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_OUTPUT_OF_THE_AL</name>
							<description>The output of the Alt PLL is used as the input to the USB clock divider.</description>
							<value>0x2</value>
						</enumeratedValue>
					
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CLKSRCSEL</name>
			<description>Clock Source Select Register</description>
			<addressOffset>0x10C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKSRC</name>
					<description>Selects the clock source for sysclk and PLL0 as follows:</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_THE_INTERNAL</name>
							<description>Selects the Internal RC oscillator as the sysclk and PLL0 clock source (default).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_THE_MAIN_OSC</name>
							<description>Selects the main oscillator as the sysclk and PLL0 clock source.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:1]</bitRange>

