cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.svd
		<register>
			<name>EMCCAL</name>
			<description>Controls the calibration counter for programmable delays and returns the result value.</description>
			<addressOffset>0x1E0</addressOffset>
			<access>read-write</access>
			<resetValue>0x1F00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CALVALUE</name>
					<description>Returns the count of the approximately 50 MHz ring oscillator that occur during 32 clocks of the IRC oscillator. This represents the composite effect of processing variation, internal regulator supply voltage, and ambient temperature.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[13:8]</bitRange>
				</field>
				<field>
					<name>START</name>
					<description>Start control bit for the EMC calibration counter. Writing a 1 to this bit begins the measurement process. This bit is cleared automatically when the measurement is complete.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>DONE</name>
					<description>Measurement completion flag. this bit is set when a calibration measurement is completed. This bit is cleared automatically when the START bit is set.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>

	
		
		
		
		
		
		

		
		

		
		





		

		
		
		
		
		
		
		
		

		
	</peripherals>
</device>
